// === Типы и структуры данных === //

// 1. Создать произвольный объект, вклчающий в себя 3 примитивных типа данны (не undefined и null), массив и объект, как свойство

let user = {};

// 2. Вывести имена свойств объекта из примера выше на экран через alert

// 3. Создать из пустого массива, массив на 10 эл-тов через цикл for

let arr = [];

// === Приведение типов === //

// 1. Упростить выражение внутри if

let isOk = true;

if (isOk === true) {
  console.log('Right!')
}

// 2. Привести значения из prompt к числам, для получения корректного мат. вычисления

let firstNum = prompt('Введите первое число');
let secondNum = prompt('Введите второе число');

alert('Сумма: ' + (firstNum + secondNum));

// === Функции, методы массивов === //

// 1. Создать функцию, принимающую один парметр name. Функция выводит через alert "Вас зовут <name>"

// 2. Создать функцию с двумя параметрами, возвращающая результат умножения одного парметра , на другое

// 3. Вывести длину массива через alert

let names = ['Аня', 'Дима', 'Даша', 'Сергей', 'Олег'];

// 4. Преобразовать массив имен таким образом, чтобы перед каждым именем было добавлено слово "пользователь: " . Должно получиться "Пользователь: Аня" ...
// Подсказка : используйте метод map

// 5. Циклом for пройтись по преобразованному массиву, и вывести каждый элемент на экран через alert


